import type { Photo } from '@/types';

export const photos: Photo[] = [
    {
        id: 1,
        src: '/like1.jpg',
        caption: 'Моя любимая фотография! Твоя улыбка на ней просто волшебная, Солнышко! 😍',
        date: '2025-07-23',
    },
    {
        id: 2,
        src: '/like2.jpg',
        caption: 'Этот момент я запомню навсегда! Ты выглядишь потрясающе, Малышка! 💕',
        date: '2025-09-08',
    },
    {
        id: 3,
        src: '/like3.jpg',
        caption: 'Обожаю эту фотографию! Ты такая красивая, Жаным! 🌹',
        date: '2025-09-22',
    },
    {
        id: 4,
        src: '/like4.jpg',
        caption: 'Одна из моих самых любимых! Твои глаза сияют, Каныкей! ✨',
        date: '2025-10-15',
    },
];
