import type { Place } from '@/types';

export const places: Place[] = [
    {
        id: 1,
        name: 'Кинотеатр - первое свидание',
        description: 'Здесь всё началось... Незабываемый вечер 23 июля, смотрели "Супермен"!',
        date: '2025-07-23',
        image: '/like1.jpg',
    },
    {
        id: 2,
        name: 'Наше любимое кафе',
        description: 'Место, где мы проводим время вместе, пьём кофе и разговариваем обо всём на свете',
        date: '2025-09-15',
        image: '/like2.jpg',
    },
    {
        id: 3,
        name: 'Парк, где был первый поцелуй',
        description: 'Романтическое место нашего первого поцелуя 22 сентября',
        date: '2025-09-22',
        image: '/like3.jpg',
    },
    {
        id: 4,
        name: 'Место наших прогулок',
        description: 'Здесь мы гуляем, держась за руки, и мечтаем о будущем',
        date: '2025-10-01',
        image: '/like4.jpg',
    },
];
