import type { TimelineEvent } from '@/types';

export const timelineEvents: TimelineEvent[] = [
    {
        id: 1,
        date: '2025-07-23',
        title: 'Первое свидание',
        description: 'Наше первое свидание - кино "Супермен"! Начало чего-то прекрасного!',
        emoji: 'Film',
    },
    {
        id: 2,
        date: '2025-08-29',
        title: 'Признание',
        description: 'День, когда я открыл тебе свое сердце и признался в чувствах!',
        emoji: 'Mail',
    },
    {
        id: 3,
        date: '2025-09-08',
        title: 'Начало отношений',
        description: 'День, когда мы официально стали парой! Самый счастливый день!',
        emoji: 'Heart',
    },
    {
        id: 4,
        date: '2025-09-22',
        title: 'Первый поцелуй',
        description: 'Незабываемый момент нашей близости',
        emoji: 'Smile',
    },
    {
        id: 5,
        date: '2025-12-08',
        title: '3 месяца вместе',
        description: 'Три месяца счастья и любви!',
        emoji: 'PartyPopper',
    },
    {
        id: 6,
        date: '2026-02-14',
        title: 'День Святого Валентина',
        description: 'Наш первый День Святого Валентина вместе! Провели его весело)) В ОФИСЕ КУШАЛИ БУРГИРЫ, А ТВОЙ ПОДАРОК ПРЯМО В СЕРДЦЕ!',
        emoji: 'Gift',
    },
    {
        id: 7,
        date: '2026-03-01',
        title: 'Начало весны',
        description: 'Первый день нашей совместной весны! Любовь расцветает как подснежники!',
        emoji: 'Sprout',
    },
];
